package Java.operator;

public class bit_operator {
    public static void main(String[] args) {

        /*
         * 비트 연산자
         * 	&	^	|
         *
         * 비트 연산자는 연산자의 좌항과 우항의 값이 숫자 값이다.
         * 비트 연산자는 좌항과 우항의 값을 비트 단위로 논리 연산한다
         *
         *
         * 		& ( AND 연산 ): 피연산자 양 쪽의 값이 모두 1일 때 1이다. 그외는 0 이다.
         * 			3 & 5
         * 				3 -> 00000011
         * 				5 -> 00000101
         * 				--------------
         * 					 00000001
         * 		| ( OR 연산 ): 피연산자 중 한 쪽의 값이 1이면 1이다. 그외는 0 이다.
         * 			3 | 5
         * 				3 -> 00000011
         * 				5 -> 00000101
         * 				--------------
         * 					 00000111
         *		^ ( XOR 연산 ): 피연산자의 값이 서로 다를 때 1이다. 같으면 0 이다.
         *			3 ^ 5
         *				3 -> 00000011
         * 				5 -> 00000101
         * 				--------------
         *					 00000110
         */
    }
}
